// Задача 15 второй семинар
Console.WriteLine("Введите цифру от 1 до 7, соответствующую дню недели");
int day = Convert.ToInt32(Console.ReadLine());
switch (day)
{
    case 1: Console.WriteLine("Нет - день не является выходным"); break;
    case 2: Console.WriteLine("Нет - день не является выходным"); break;
    case 3: Console.WriteLine("Нет - день не является выходным"); break;
    case 4: Console.WriteLine("Нет - день не является выходным"); break;
    case 5: Console.WriteLine("Нет - день не является выходным"); break;
    case 6: Console.WriteLine("Да - день является выходным"); break;
    case 7: Console.WriteLine("Да - день является выходным"); break;
}
